# ECE 204: Midterm 1 (Fall 2022)

## Item 2: Lightning Questions

Please add/delete cells as necessary below to answer the questions in this item.

In [162]:

mylist = [0, 1, 2, 3]
newlist = [3] +  2 * mylist
newlist

[3, 0, 1, 2, 3, 0, 1, 2, 3]

In [220]:
m, i, d, t, e, r = 2, 0, 4, True, False, True
x = d
y = i
not (i or r // 2) and (x + y)

0

In [235]:
num = list(nums)
num.remove(max(num))
num.remove(max(num))

0.0

In [236]:

from functools import reduce
import random
r = lambda x: random.randint(1, 6)
random.seed(2)

numbers = [1, 2, 3, 4, 5]
numbers += [r(0), r(0), r(0), r(0)] * 2

reduce(lambda x, y : x*y, numbers)

1080

In [237]:
import random
r = lambda _: random.randint(0, 4)
s = lambda _: 's' + str(r(0))

random.seed(0)
nums = [r(0), r(0), r(0), r(0), r(0), r(0), r(0), r(0), r(0), r(0), r(0), r(0), r(0), r(0),
        r(0), r(0), r(0), r(0), r(0), r(0), r(0), r(0), r(0), r(0), r(0), r(0), r(0), r(0),
        r(0), r(0), r(0), r(0), r(0), r(0), r(0)]
sum(nums)
count = 0
i = 0
while (i < 70):
    count += nums[i]
    i +=2

count

IndexError: list index out of range

In [ ]:
import math

def is_perfect_square(x):
  root = math.sqrt(x)
  return root == int(root)

def is_fibonacci(n):
  num1 = 5*(n**2) + 4
  num2 = 5*(n**2) - 4
  return is_perfect_square(num1) or is_perfect_square(num2)

numRange1 = range(165580138, 165580148)
fibNums1 = filter(lambda x : is_fibonacci(x), numRange1)
fibNums1

numRange2 = range(4807526973, 4807526978)
fibNums2 = filter(lambda x : is_fibonacci(x), numRange2)
fibNums2

## Item 3: Bird Strikes

In [ ]:
import pandas as pd
df_birds = pd.read_csv('bird_strikes.csv')
df_birds.head()

      Date             Airline OriginState TimeOfDay  Speed
0   1/8/90            MILITARY   Louisiana       Day    304
1   1/9/90            MILITARY   Louisiana     Night    209
2  1/11/90            MILITARY   Louisiana       Day    137
3  1/11/90  SOUTHWEST AIRLINES   Louisiana       Day    148
4  1/12/90            MILITARY   Louisiana       Day    164

Please add/delete cells as necessary below to answer the questions in this item.

In [ ]:
df_birds

         Date                Airline   OriginState TimeOfDay  Speed
0      1/8/90               MILITARY     Louisiana       Day    304
1      1/9/90               MILITARY     Louisiana     Night    209
2     1/11/90               MILITARY     Louisiana       Day    137
3     1/11/90     SOUTHWEST AIRLINES     Louisiana       Day    148
4     1/12/90               MILITARY     Louisiana       Day    164
...       ...                    ...           ...       ...    ...
7159  7/24/02          FEDEX EXPRESS       Indiana     Night    221
7160  7/24/02      AMERICAN AIRLINES         Texas       Day    253
7161  7/24/02      AMERICAN AIRLINES      Colorado       Day    129
7162  7/25/02               MILITARY     Louisiana       Day    112
7163  7/25/02  TRANS STATES AIRLINES  Pennsylvania       Day    140

[7164 rows x 5 columns]

In [ ]:
df_birds.iloc[353]

Date                     11/2/90
Airline        AMERICAN AIRLINES
OriginState           California
TimeOfDay                   Dawn
Speed                        155
Name: 353, dtype: object

In [ ]:

dawn = (df_birds[df_birds['TimeOfDay'] == 'Dawn'])
dawn

         Date                Airline     OriginState TimeOfDay  Speed
22    4/16/90               MILITARY       Louisiana      Dawn    151
28    4/23/90               MILITARY       Louisiana      Dawn    197
103   6/18/90  AMERICA WEST AIRLINES   Massachusetts      Dawn    133
132   7/11/90        DELTA AIR LINES         Georgia      Dawn    138
134   7/13/90         ALOHA AIRLINES          Hawaii      Dawn     91
...       ...                    ...             ...       ...    ...
7072  6/25/02        DELTA AIR LINES            Ohio      Dawn    165
7089   7/3/02   TRANS WORLD AIRLINES      California      Dawn    158
7101   7/8/02     SOUTHWEST AIRLINES          Oregon      Dawn    145
7102   7/8/02               MILITARY  South Carolina      Dawn    140
7149  7/22/02  TRANS STATES AIRLINES    Pennsylvania      Dawn    124

[315 rows x 5 columns]

In [ ]:

mean = df_birds['Speed'].mean()
median = df_birds['Speed'].median()

mean

158.48394751535454

In [ ]:
median

147.0

## Item 4: Elections

In [ ]:
import pandas as pd
df_all = pd.read_csv('elections.csv')
df_all.head()

,year,state,state_po,candidate,party,writein,candidatevotes
0,1976,ALABAMA,AL,"CARTER, JIMMY",DEMOCRAT,False,659171
1,1976,ALABAMA,AL,"FORD, GERALD",REPUBLICAN,False,504071
2,1976,ALABAMA,AL,"MADDOX, LESTER",AMERICAN INDEPENDENT PARTY,False,9199
3,1976,ALABAMA,AL,"BUBAR, BENJAMIN """"BEN""""",PROHIBITION,False,6670
4,1976,ALABAMA,AL,"HALL, GUS",COMMUNIST PARTY USE,False,1955

Please add/delete cells as necessary below to answer the questions in this item.

In [ ]:
df_year = (df_all[df_all['year'] == 1988])
df_year

,year,state,state_po,candidate,party,writein,candidatevotes
1019,1988,ALABAMA,AL,"BUSH, GEORGE H.W.",REPUBLICAN,False,815577
1020,1988,ALABAMA,AL,"DUKAKIS, MICHAEL",DEMOCRAT,False,549507
1021,1988,ALABAMA,AL,"PAUL, RONALD """"RON""""",LIBERTARIAN,False,8461
1022,1988,ALABAMA,AL,"WINN, EDWARD",INDEPENDENT,False,4429
1023,1988,ALABAMA,AL,NaN,NaN,True,507
...,...,...,...,...,...,...,...
1299,1988,WISCONSIN,WI,SCATTERING,NaN,False,2274
1300,1988,WYOMING,WY,"BUSH, GEORGE H.W.",REPUBLICAN,False,106868
1301,1988,WYOMING,WY,"DUKAKIS, MICHAEL",DEMOCRAT,False,67114
1302,1988,WYOMING,WY,"PAUL, RONALD """"RON""""",LIBERTARIAN,False,2027
1303,1988,WYOMING,WY,"FULANI, LENORA",NEW ALLIANCE,False,546

In [ ]:
total_votes = df_year['candidatevotes'].sum()
total_votes

91587110

In [ ]:
total_writein = (df_year[df_year['writein'] == True])["candidatevotes"]

sum(total_writein)

10523

In [ ]:
df_year_state = df_year[df_year['state'] == "CALIFORNIA"]
df_year_state

,year,state,state_po,candidate,party,writein,candidatevotes
1041,1988,CALIFORNIA,CA,"BUSH, GEORGE H.W.",REPUBLICAN,False,5054918
1042,1988,CALIFORNIA,CA,"DUKAKIS, MICHAEL",DEMOCRAT,False,4702234
1043,1988,CALIFORNIA,CA,"PAUL, RONALD """"RON""""",LIBERTARIAN,False,70106
1044,1988,CALIFORNIA,CA,"FULANI, LENORA",INDEPENDENT,False,59000
1045,1988,CALIFORNIA,CA,NaN,NaN,True,812